hr_ext/InformationRegisters/кс_АккаунтыКабинета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>кс_АккаунтыКабинета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

hr_ext/CommonModules/кс_КабинетКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция НастройкиПодключения() Экспорт
	Настройки = Новый Структура;
	Настройки.Вставить("Адрес", СокрЛП(Константы.АдресКабинета.Получить()));
	Настройки.Вставить("Токен", СокрЛП(Константы.ТокенСервисный.Получить()));
	Возврат Настройки;
КонецФункции

Функция НастройкиЗаданы(Настройки) Экспорт
	Возврат ЗначениеЗаполнено(Настройки.Адрес) И ЗначениеЗаполнено(Настройки.Токен);
КонецФункции

Функция СоздатьАккаунт(Сотрудник) Экспорт
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("uuid", Строка(Сотрудник.УникальныйИдентификатор()));
	ПараметрыЗапроса.Вставить("username", ТабельныйНомер(Сотрудник));
	Результат = ВыполнитьОперацию("POST", "employees/", ПараметрыЗапроса);
	Если Результат.Успех Тогда
		ЗафиксироватьАккаунт(Сотрудник);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция СброситьДоступ(Сотрудник) Экспорт
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("uuid", Строка(Сотрудник.УникальныйИдентификатор()));
	Результат = ВыполнитьОперацию("POST", "employees/reset/", ПараметрыЗапроса);
	Если Результат.Успех Тогда
		ЗафиксироватьАккаунт(Сотрудник);
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТабельныйНомер(Сотрудник)
	Возврат СокрЛП(Сотрудник.Код);
КонецФункции

Процедура ЗафиксироватьАккаунт(Сотрудник)
	МенеджерЗаписи = РегистрыСведений.кс_АккаунтыКабинета.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сотрудник = Сотрудник;
	МенеджерЗаписи.Активный = Истина;
	МенеджерЗаписи.ДатаСоздания = НачалоДня(ТекущаяДатаСеанса());
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

Функция ВыполнитьОперацию(Метод, Путь, Параметры)
	Результат = Новый Структура("Успех, Логин, Пароль, Секрет, Сообщение", Ложь, "", "", "", "");
	Настройки = НастройкиПодключения();
	Если Не НастройкиЗаданы(Настройки) Тогда
		Результат.Сообщение = "Не заданы адрес кабинета или сервисный токен (см. константы расширения).";
		Возврат Результат;
	КонецЕсли;

	Хост = "";
	Порт = 0;
	Защищенное = Ложь;
	БазовыйПуть = РазобратьАдрес(Настройки.Адрес, Хост, Порт, Защищенное);

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "Token " + Настройки.Токен);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Параметры);
	Тело = Запись.Закрыть();

	Запрос = Новый HTTPЗапрос("/api/" + Путь, Заголовки);
	Запрос.УстановитьТелоИзСтроки(Тело);

	Попытка
		Если Защищенное Тогда
			Соединение = Новый HTTPСоединение(Хост, Порт, , , , 30, Новый ЗащищенноеСоединениеOpenSSL);
		Иначе
			Соединение = Новый HTTPСоединение(Хост, Порт, , , , 30);
		КонецЕсли;
		Ответ = Соединение.ВызватьHTTPМетод(Метод, Запрос);
	Исключение
		Результат.Сообщение = "Не удалось подключиться к кабинету: "
			+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;

	Если Ответ.КодСостояния = 200 ИЛИ Ответ.КодСостояния = 201 Тогда
		Данные = РазобратьJSON(Ответ.ПолучитьТелоКакСтроку());
		Результат.Успех = Истина;
		Результат.Логин = Строка(Данные.Получить("username"));
		Результат.Пароль = Строка(Данные.Получить("password"));
		Результат.Секрет = Строка(Данные.Получить("totp_secret"));
		Возврат Результат;
	КонецЕсли;

	Если Ответ.КодСостояния = 401 ИЛИ Ответ.КодСостояния = 403 Тогда
		Результат.Сообщение = "Кабинет отклонил сервисный токен (код " + Ответ.КодСостояния + ").";
	ИначеЕсли Ответ.КодСостояния = 400 Тогда
		Результат.Сообщение = "Кабинет отклонил запрос: " + ТекстОшибкиКабинета(Ответ.ПолучитьТелоКакСтроку());
	ИначеЕсли Ответ.КодСостояния = 404 Тогда
		Результат.Сообщение = "Сотрудник с таким GUID не найден на портале (код 404).";
	Иначе
		Результат.Сообщение = "Кабинет вернул ошибку " + Ответ.КодСостояния + ": "
			+ Лев(СокрЛП(Ответ.ПолучитьТелоКакСтроку()), 200);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РазобратьАдрес(Адрес, Хост, Порт, Защищенное)
	Защищенное = Ложь;
	БезСхемы = СокрЛП(Адрес);
	Если СтрНачинаетсяС(БезСхемы, "https://") Тогда
		Защищенное = Истина;
		БезСхемы = Сред(БезСхемы, 9);
	ИначеЕсли СтрНачинаетсяС(БезСхемы, "http://") Тогда
		БезСхемы = Сред(БезСхемы, 8);
	КонецЕсли;

	ПозицияСлэша = СтрНайти(БезСхемы, "/");
	Если ПозицияСлэша = 0 Тогда
		Хост = БезСхемы;
		БазовыйПуть = "";
	Иначе
		Хост = Лев(БезСхемы, ПозицияСлэша - 1);
		БазовыйПуть = Сред(БезСхемы, ПозицияСлэша);
		Пока СтрЗаканчиваетсяНа(БазовыйПуть, "/") Цикл
			БазовыйПуть = Лев(БазовыйПуть, СтрДлина(БазовыйПуть) - 1);
		КонецЦикла;
	КонецЕсли;

	Порт = ?(Защищенное, 443, 80);
	ПозицияДвоеточия = СтрНайти(Хост, ":");
	Если ПозицияДвоеточия > 0 Тогда
		Порт = Число(Сред(Хост, ПозицияДвоеточия + 1));
		Хост = Лев(Хост, ПозицияДвоеточия - 1);
	КонецЕсли;
	Возврат БазовыйПуть;
КонецФункции
Функция РазобратьJSON(Текст)
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Текст);
		Результат = ПрочитатьJSON(Чтение, Истина);
		Чтение.Закрыть();
		Возврат Результат;
	Исключение
		Возврат Новый Соответствие;
	КонецПопытки;
КонецФункции

Функция ТекстОшибкиКабинета(ТекстОтвета)
	Данные = РазобратьJSON(ТекстОтвета);
	Ошибка = ВРег(Строка(Данные.Получить("error")));
	Если Ошибка = "ALREADY_EXISTS" Тогда
		Возврат "аккаунт с таким сотрудником или логином уже существует.";
	КонецЕсли;
	Если Ошибка = "INVALID_INPUT" Тогда
		Возврат "некорректные данные запроса (проверьте табельный номер).";
	КонецЕсли;
	Возврат Лев(СокрЛП(ТекстОтвета), 200);
КонецФункции

#КонецОбласти
